dominiczy/satelliteplatform/processors/msp430sctlm/msp430_isa_init.cpp
/******************************************************
 * AC_ISA Initialization File                         *
 * This file is automatically generated by ArchC      *
 * WITHOUT WARRANTY OF ANY KIND, either express       *
 * or implied.                                        *
 * For more information on ArchC, please visit:       *
 * http://www.archc.org                               *
 *                                                    *
 * The ArchC Team                                     *
 * Computer Systems Laboratory (LSC)                  *
 * IC-UNICAMP                                         *
 * http://www.lsc.ic.unicamp.br                       *
 ******************************************************/
 

#include "msp430_isa.H"

//!Fields table declaration.
ac_dec_field msp430_parms::msp430_isa::fields[msp430_parms::AC_DEC_FIELD_NUMBER] = {
  {"odst", 16, 47, 1, 0, 0, &(msp430_parms::msp430_isa::fields[1])},
  {"osrc", 16, 31, 2, 0, 0, &(msp430_parms::msp430_isa::fields[2])},
  {"op", 4, 15, 3, 0, 0, &(msp430_parms::msp430_isa::fields[3])},
  {"sreg", 4, 11, 4, 0, 0, &(msp430_parms::msp430_isa::fields[4])},
  {"ad", 1, 7, 5, 0, 0, &(msp430_parms::msp430_isa::fields[5])},
  {"bw", 1, 6, 6, 0, 0, &(msp430_parms::msp430_isa::fields[6])},
  {"as", 2, 5, 7, 0, 0, &(msp430_parms::msp430_isa::fields[7])},
  {"dreg", 4, 3, 8, 0, 0, NULL},
  {"oset", 16, 31, 2, 0, 0, &(msp430_parms::msp430_isa::fields[9])},
  {"op", 4, 15, 3, 0, 0, &(msp430_parms::msp430_isa::fields[10])},
  {"sreg", 4, 11, 4, 0, 0, &(msp430_parms::msp430_isa::fields[11])},
  {"ad", 1, 7, 5, 0, 0, &(msp430_parms::msp430_isa::fields[12])},
  {"bw", 1, 6, 6, 0, 0, &(msp430_parms::msp430_isa::fields[13])},
  {"as", 2, 5, 7, 0, 0, &(msp430_parms::msp430_isa::fields[14])},
  {"dreg", 4, 3, 8, 0, 0, NULL},
  {"op", 4, 15, 3, 0, 0, &(msp430_parms::msp430_isa::fields[16])},
  {"sreg", 4, 11, 4, 0, 0, &(msp430_parms::msp430_isa::fields[17])},
  {"ad", 1, 7, 5, 0, 0, &(msp430_parms::msp430_isa::fields[18])},
  {"bw", 1, 6, 6, 0, 0, &(msp430_parms::msp430_isa::fields[19])},
  {"as", 2, 5, 7, 0, 0, &(msp430_parms::msp430_isa::fields[20])},
  {"dreg", 4, 3, 8, 0, 0, NULL},
  {"oset", 16, 31, 2, 0, 0, &(msp430_parms::msp430_isa::fields[22])},
  {"cnt", 6, 15, 9, 0, 0, &(msp430_parms::msp430_isa::fields[23])},
  {"op", 3, 9, 10, 0, 0, &(msp430_parms::msp430_isa::fields[24])},
  {"bw", 1, 6, 6, 0, 0, &(msp430_parms::msp430_isa::fields[25])},
  {"as", 2, 5, 7, 0, 0, &(msp430_parms::msp430_isa::fields[26])},
  {"sreg", 4, 3, 8, 0, 0, NULL},
  {"cnt", 6, 15, 9, 0, 0, &(msp430_parms::msp430_isa::fields[28])},
  {"op", 3, 9, 10, 0, 0, &(msp430_parms::msp430_isa::fields[29])},
  {"bw", 1, 6, 6, 0, 0, &(msp430_parms::msp430_isa::fields[30])},
  {"as", 2, 5, 7, 0, 0, &(msp430_parms::msp430_isa::fields[31])},
  {"sreg", 4, 3, 8, 0, 0, NULL},
  {"opc", 3, 15, 11, 0, 0, &(msp430_parms::msp430_isa::fields[33])},
  {"c", 3, 12, 12, 0, 0, &(msp430_parms::msp430_isa::fields[34])},
  {"offset", 10, 9, 13, 0, 1, NULL}
};

ac_dec_format msp430_parms::msp430_isa::formats[msp430_parms::AC_DEC_FORMAT_NUMBER] = {
  {"Double_48", 48, &(msp430_parms::msp430_isa::fields[0]), &(msp430_parms::msp430_isa::formats[1])},
  {"Double_32", 32, &(msp430_parms::msp430_isa::fields[8]), &(msp430_parms::msp430_isa::formats[2])},
  {"Double", 16, &(msp430_parms::msp430_isa::fields[15]), &(msp430_parms::msp430_isa::formats[3])},
  {"Single_32", 32, &(msp430_parms::msp430_isa::fields[21]), &(msp430_parms::msp430_isa::formats[4])},
  {"Single", 16, &(msp430_parms::msp430_isa::fields[27]), &(msp430_parms::msp430_isa::formats[5])},
  {"Jump", 16, &(msp430_parms::msp430_isa::fields[32]), NULL}
};

ac_dec_list msp430_parms::msp430_isa::dec_list[msp430_parms::AC_DEC_LIST_NUMBER] = {
  {"op", 3, 4, &(msp430_parms::msp430_isa::dec_list[1])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[2])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[3])},
  {"as", 7, 3, NULL},
  {"op", 3, 4, &(msp430_parms::msp430_isa::dec_list[5])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[6])},
  {"as", 7, 1, NULL},
  {"op", 3, 5, &(msp430_parms::msp430_isa::dec_list[8])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[9])},
  {"as", 7, 1, NULL},
  {"op", 3, 5, &(msp430_parms::msp430_isa::dec_list[11])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[12])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[13])},
  {"as", 7, 3, NULL},
  {"op", 3, 6, &(msp430_parms::msp430_isa::dec_list[15])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[16])},
  {"as", 7, 1, NULL},
  {"op", 3, 6, &(msp430_parms::msp430_isa::dec_list[18])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[19])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[20])},
  {"as", 7, 3, NULL},
  {"op", 3, 15, &(msp430_parms::msp430_isa::dec_list[22])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[23])},
  {"as", 7, 1, NULL},
  {"op", 3, 15, &(msp430_parms::msp430_isa::dec_list[25])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[26])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[27])},
  {"as", 7, 3, NULL},
  {"op", 3, 12, &(msp430_parms::msp430_isa::dec_list[29])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[30])},
  {"as", 7, 1, NULL},
  {"op", 3, 12, &(msp430_parms::msp430_isa::dec_list[32])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[33])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[34])},
  {"as", 7, 3, NULL},
  {"op", 3, 13, &(msp430_parms::msp430_isa::dec_list[36])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[37])},
  {"as", 7, 1, NULL},
  {"op", 3, 13, &(msp430_parms::msp430_isa::dec_list[39])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[40])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[41])},
  {"as", 7, 3, NULL},
  {"op", 3, 11, &(msp430_parms::msp430_isa::dec_list[43])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[44])},
  {"as", 7, 1, NULL},
  {"op", 3, 11, &(msp430_parms::msp430_isa::dec_list[46])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[47])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[48])},
  {"as", 7, 3, NULL},
  {"op", 3, 9, &(msp430_parms::msp430_isa::dec_list[50])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[51])},
  {"as", 7, 1, NULL},
  {"op", 3, 9, &(msp430_parms::msp430_isa::dec_list[53])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[54])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[55])},
  {"as", 7, 3, NULL},
  {"op", 3, 10, &(msp430_parms::msp430_isa::dec_list[57])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[58])},
  {"as", 7, 1, NULL},
  {"op", 3, 10, &(msp430_parms::msp430_isa::dec_list[60])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[61])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[62])},
  {"as", 7, 3, NULL},
  {"op", 3, 8, &(msp430_parms::msp430_isa::dec_list[64])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[65])},
  {"as", 7, 1, NULL},
  {"op", 3, 8, &(msp430_parms::msp430_isa::dec_list[67])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[68])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[69])},
  {"as", 7, 3, NULL},
  {"op", 3, 7, &(msp430_parms::msp430_isa::dec_list[71])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[72])},
  {"as", 7, 1, NULL},
  {"op", 3, 7, &(msp430_parms::msp430_isa::dec_list[74])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[75])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[76])},
  {"as", 7, 3, NULL},
  {"op", 3, 14, &(msp430_parms::msp430_isa::dec_list[78])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[79])},
  {"as", 7, 1, NULL},
  {"op", 3, 14, &(msp430_parms::msp430_isa::dec_list[81])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[82])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[83])},
  {"as", 7, 3, NULL},
  {"op", 3, 4, &(msp430_parms::msp430_isa::dec_list[85])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[86])},
  {"as", 7, 0, NULL},
  {"op", 3, 4, &(msp430_parms::msp430_isa::dec_list[88])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[89])},
  {"as", 7, 1, NULL},
  {"op", 3, 4, &(msp430_parms::msp430_isa::dec_list[91])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[92])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[93])},
  {"as", 7, 3, NULL},
  {"op", 3, 4, &(msp430_parms::msp430_isa::dec_list[95])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[96])},
  {"ad", 5, 1, NULL},
  {"op", 3, 4, &(msp430_parms::msp430_isa::dec_list[98])},
  {"as", 7, 2, NULL},
  {"op", 3, 5, &(msp430_parms::msp430_isa::dec_list[100])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[101])},
  {"as", 7, 0, NULL},
  {"op", 3, 5, &(msp430_parms::msp430_isa::dec_list[103])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[104])},
  {"as", 7, 1, NULL},
  {"op", 3, 5, &(msp430_parms::msp430_isa::dec_list[106])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[107])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[108])},
  {"as", 7, 3, NULL},
  {"op", 3, 5, &(msp430_parms::msp430_isa::dec_list[110])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[111])},
  {"ad", 5, 1, NULL},
  {"op", 3, 5, &(msp430_parms::msp430_isa::dec_list[113])},
  {"as", 7, 2, NULL},
  {"op", 3, 6, &(msp430_parms::msp430_isa::dec_list[115])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[116])},
  {"as", 7, 0, NULL},
  {"op", 3, 6, &(msp430_parms::msp430_isa::dec_list[118])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[119])},
  {"as", 7, 1, NULL},
  {"op", 3, 6, &(msp430_parms::msp430_isa::dec_list[121])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[122])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[123])},
  {"as", 7, 3, NULL},
  {"op", 3, 6, &(msp430_parms::msp430_isa::dec_list[125])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[126])},
  {"ad", 5, 1, NULL},
  {"op", 3, 6, &(msp430_parms::msp430_isa::dec_list[128])},
  {"as", 7, 2, NULL},
  {"op", 3, 15, &(msp430_parms::msp430_isa::dec_list[130])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[131])},
  {"as", 7, 0, NULL},
  {"op", 3, 15, &(msp430_parms::msp430_isa::dec_list[133])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[134])},
  {"as", 7, 1, NULL},
  {"op", 3, 15, &(msp430_parms::msp430_isa::dec_list[136])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[137])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[138])},
  {"as", 7, 3, NULL},
  {"op", 3, 15, &(msp430_parms::msp430_isa::dec_list[140])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[141])},
  {"ad", 5, 1, NULL},
  {"op", 3, 15, &(msp430_parms::msp430_isa::dec_list[143])},
  {"as", 7, 2, NULL},
  {"op", 3, 12, &(msp430_parms::msp430_isa::dec_list[145])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[146])},
  {"as", 7, 0, NULL},
  {"op", 3, 12, &(msp430_parms::msp430_isa::dec_list[148])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[149])},
  {"as", 7, 1, NULL},
  {"op", 3, 12, &(msp430_parms::msp430_isa::dec_list[151])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[152])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[153])},
  {"as", 7, 3, NULL},
  {"op", 3, 12, &(msp430_parms::msp430_isa::dec_list[155])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[156])},
  {"ad", 5, 1, NULL},
  {"op", 3, 12, &(msp430_parms::msp430_isa::dec_list[158])},
  {"as", 7, 2, NULL},
  {"op", 3, 13, &(msp430_parms::msp430_isa::dec_list[160])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[161])},
  {"as", 7, 0, NULL},
  {"op", 3, 13, &(msp430_parms::msp430_isa::dec_list[163])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[164])},
  {"as", 7, 1, NULL},
  {"op", 3, 13, &(msp430_parms::msp430_isa::dec_list[166])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[167])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[168])},
  {"as", 7, 3, NULL},
  {"op", 3, 13, &(msp430_parms::msp430_isa::dec_list[170])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[171])},
  {"ad", 5, 1, NULL},
  {"op", 3, 13, &(msp430_parms::msp430_isa::dec_list[173])},
  {"as", 7, 2, NULL},
  {"op", 3, 11, &(msp430_parms::msp430_isa::dec_list[175])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[176])},
  {"as", 7, 0, NULL},
  {"op", 3, 11, &(msp430_parms::msp430_isa::dec_list[178])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[179])},
  {"as", 7, 1, NULL},
  {"op", 3, 11, &(msp430_parms::msp430_isa::dec_list[181])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[182])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[183])},
  {"as", 7, 3, NULL},
  {"op", 3, 11, &(msp430_parms::msp430_isa::dec_list[185])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[186])},
  {"ad", 5, 1, NULL},
  {"op", 3, 11, &(msp430_parms::msp430_isa::dec_list[188])},
  {"as", 7, 2, NULL},
  {"op", 3, 9, &(msp430_parms::msp430_isa::dec_list[190])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[191])},
  {"as", 7, 0, NULL},
  {"op", 3, 9, &(msp430_parms::msp430_isa::dec_list[193])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[194])},
  {"as", 7, 1, NULL},
  {"op", 3, 9, &(msp430_parms::msp430_isa::dec_list[196])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[197])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[198])},
  {"as", 7, 3, NULL},
  {"op", 3, 9, &(msp430_parms::msp430_isa::dec_list[200])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[201])},
  {"ad", 5, 1, NULL},
  {"op", 3, 9, &(msp430_parms::msp430_isa::dec_list[203])},
  {"as", 7, 2, NULL},
  {"op", 3, 10, &(msp430_parms::msp430_isa::dec_list[205])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[206])},
  {"as", 7, 0, NULL},
  {"op", 3, 10, &(msp430_parms::msp430_isa::dec_list[208])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[209])},
  {"as", 7, 1, NULL},
  {"op", 3, 10, &(msp430_parms::msp430_isa::dec_list[211])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[212])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[213])},
  {"as", 7, 3, NULL},
  {"op", 3, 10, &(msp430_parms::msp430_isa::dec_list[215])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[216])},
  {"ad", 5, 1, NULL},
  {"op", 3, 10, &(msp430_parms::msp430_isa::dec_list[218])},
  {"as", 7, 2, NULL},
  {"op", 3, 8, &(msp430_parms::msp430_isa::dec_list[220])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[221])},
  {"as", 7, 0, NULL},
  {"op", 3, 8, &(msp430_parms::msp430_isa::dec_list[223])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[224])},
  {"as", 7, 1, NULL},
  {"op", 3, 8, &(msp430_parms::msp430_isa::dec_list[226])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[227])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[228])},
  {"as", 7, 3, NULL},
  {"op", 3, 8, &(msp430_parms::msp430_isa::dec_list[230])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[231])},
  {"ad", 5, 1, NULL},
  {"op", 3, 8, &(msp430_parms::msp430_isa::dec_list[233])},
  {"as", 7, 2, NULL},
  {"op", 3, 7, &(msp430_parms::msp430_isa::dec_list[235])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[236])},
  {"as", 7, 0, NULL},
  {"op", 3, 7, &(msp430_parms::msp430_isa::dec_list[238])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[239])},
  {"as", 7, 1, NULL},
  {"op", 3, 7, &(msp430_parms::msp430_isa::dec_list[241])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[242])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[243])},
  {"as", 7, 3, NULL},
  {"op", 3, 7, &(msp430_parms::msp430_isa::dec_list[245])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[246])},
  {"ad", 5, 1, NULL},
  {"op", 3, 7, &(msp430_parms::msp430_isa::dec_list[248])},
  {"as", 7, 2, NULL},
  {"op", 3, 14, &(msp430_parms::msp430_isa::dec_list[250])},
  {"ad", 5, 1, &(msp430_parms::msp430_isa::dec_list[251])},
  {"as", 7, 0, NULL},
  {"op", 3, 14, &(msp430_parms::msp430_isa::dec_list[253])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[254])},
  {"as", 7, 1, NULL},
  {"op", 3, 14, &(msp430_parms::msp430_isa::dec_list[256])},
  {"sreg", 4, 0, &(msp430_parms::msp430_isa::dec_list[257])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[258])},
  {"as", 7, 3, NULL},
  {"op", 3, 14, &(msp430_parms::msp430_isa::dec_list[260])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[261])},
  {"ad", 5, 1, NULL},
  {"op", 3, 14, &(msp430_parms::msp430_isa::dec_list[263])},
  {"as", 7, 2, NULL},
  {"op", 3, 4, &(msp430_parms::msp430_isa::dec_list[265])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[266])},
  {"as", 7, 0, NULL},
  {"op", 3, 4, &(msp430_parms::msp430_isa::dec_list[268])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[269])},
  {"as", 7, 2, NULL},
  {"op", 3, 4, &(msp430_parms::msp430_isa::dec_list[271])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[272])},
  {"ad", 5, 0, NULL},
  {"op", 3, 5, &(msp430_parms::msp430_isa::dec_list[274])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[275])},
  {"as", 7, 0, NULL},
  {"op", 3, 5, &(msp430_parms::msp430_isa::dec_list[277])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[278])},
  {"as", 7, 2, NULL},
  {"op", 3, 5, &(msp430_parms::msp430_isa::dec_list[280])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[281])},
  {"ad", 5, 0, NULL},
  {"op", 3, 6, &(msp430_parms::msp430_isa::dec_list[283])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[284])},
  {"as", 7, 0, NULL},
  {"op", 3, 6, &(msp430_parms::msp430_isa::dec_list[286])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[287])},
  {"as", 7, 2, NULL},
  {"op", 3, 6, &(msp430_parms::msp430_isa::dec_list[289])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[290])},
  {"ad", 5, 0, NULL},
  {"op", 3, 15, &(msp430_parms::msp430_isa::dec_list[292])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[293])},
  {"as", 7, 0, NULL},
  {"op", 3, 15, &(msp430_parms::msp430_isa::dec_list[295])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[296])},
  {"as", 7, 2, NULL},
  {"op", 3, 15, &(msp430_parms::msp430_isa::dec_list[298])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[299])},
  {"ad", 5, 0, NULL},
  {"op", 3, 12, &(msp430_parms::msp430_isa::dec_list[301])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[302])},
  {"as", 7, 0, NULL},
  {"op", 3, 12, &(msp430_parms::msp430_isa::dec_list[304])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[305])},
  {"as", 7, 2, NULL},
  {"op", 3, 12, &(msp430_parms::msp430_isa::dec_list[307])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[308])},
  {"ad", 5, 0, NULL},
  {"op", 3, 13, &(msp430_parms::msp430_isa::dec_list[310])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[311])},
  {"as", 7, 0, NULL},
  {"op", 3, 13, &(msp430_parms::msp430_isa::dec_list[313])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[314])},
  {"as", 7, 2, NULL},
  {"op", 3, 13, &(msp430_parms::msp430_isa::dec_list[316])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[317])},
  {"ad", 5, 0, NULL},
  {"op", 3, 11, &(msp430_parms::msp430_isa::dec_list[319])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[320])},
  {"as", 7, 0, NULL},
  {"op", 3, 11, &(msp430_parms::msp430_isa::dec_list[322])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[323])},
  {"as", 7, 2, NULL},
  {"op", 3, 11, &(msp430_parms::msp430_isa::dec_list[325])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[326])},
  {"ad", 5, 0, NULL},
  {"op", 3, 9, &(msp430_parms::msp430_isa::dec_list[328])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[329])},
  {"as", 7, 0, NULL},
  {"op", 3, 9, &(msp430_parms::msp430_isa::dec_list[331])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[332])},
  {"as", 7, 2, NULL},
  {"op", 3, 9, &(msp430_parms::msp430_isa::dec_list[334])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[335])},
  {"ad", 5, 0, NULL},
  {"op", 3, 10, &(msp430_parms::msp430_isa::dec_list[337])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[338])},
  {"as", 7, 0, NULL},
  {"op", 3, 10, &(msp430_parms::msp430_isa::dec_list[340])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[341])},
  {"as", 7, 2, NULL},
  {"op", 3, 10, &(msp430_parms::msp430_isa::dec_list[343])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[344])},
  {"ad", 5, 0, NULL},
  {"op", 3, 8, &(msp430_parms::msp430_isa::dec_list[346])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[347])},
  {"as", 7, 0, NULL},
  {"op", 3, 8, &(msp430_parms::msp430_isa::dec_list[349])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[350])},
  {"as", 7, 2, NULL},
  {"op", 3, 8, &(msp430_parms::msp430_isa::dec_list[352])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[353])},
  {"ad", 5, 0, NULL},
  {"op", 3, 7, &(msp430_parms::msp430_isa::dec_list[355])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[356])},
  {"as", 7, 0, NULL},
  {"op", 3, 7, &(msp430_parms::msp430_isa::dec_list[358])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[359])},
  {"as", 7, 2, NULL},
  {"op", 3, 7, &(msp430_parms::msp430_isa::dec_list[361])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[362])},
  {"ad", 5, 0, NULL},
  {"op", 3, 14, &(msp430_parms::msp430_isa::dec_list[364])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[365])},
  {"as", 7, 0, NULL},
  {"op", 3, 14, &(msp430_parms::msp430_isa::dec_list[367])},
  {"ad", 5, 0, &(msp430_parms::msp430_isa::dec_list[368])},
  {"as", 7, 2, NULL},
  {"op", 3, 14, &(msp430_parms::msp430_isa::dec_list[370])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[371])},
  {"ad", 5, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[373])},
  {"op", 10, 0, &(msp430_parms::msp430_isa::dec_list[374])},
  {"as", 7, 1, &(msp430_parms::msp430_isa::dec_list[375])},
  {"sreg", 8, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[377])},
  {"op", 10, 0, &(msp430_parms::msp430_isa::dec_list[378])},
  {"as", 7, 1, &(msp430_parms::msp430_isa::dec_list[379])},
  {"sreg", 8, 2, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[381])},
  {"op", 10, 0, &(msp430_parms::msp430_isa::dec_list[382])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[383])},
  {"sreg", 8, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[385])},
  {"op", 10, 0, &(msp430_parms::msp430_isa::dec_list[386])},
  {"as", 7, 1, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[388])},
  {"op", 10, 2, &(msp430_parms::msp430_isa::dec_list[389])},
  {"as", 7, 1, &(msp430_parms::msp430_isa::dec_list[390])},
  {"sreg", 8, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[392])},
  {"op", 10, 2, &(msp430_parms::msp430_isa::dec_list[393])},
  {"as", 7, 1, &(msp430_parms::msp430_isa::dec_list[394])},
  {"sreg", 8, 2, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[396])},
  {"op", 10, 2, &(msp430_parms::msp430_isa::dec_list[397])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[398])},
  {"sreg", 8, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[400])},
  {"op", 10, 2, &(msp430_parms::msp430_isa::dec_list[401])},
  {"as", 7, 1, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[403])},
  {"op", 10, 1, &(msp430_parms::msp430_isa::dec_list[404])},
  {"as", 7, 1, &(msp430_parms::msp430_isa::dec_list[405])},
  {"sreg", 8, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[407])},
  {"op", 10, 1, &(msp430_parms::msp430_isa::dec_list[408])},
  {"as", 7, 1, &(msp430_parms::msp430_isa::dec_list[409])},
  {"sreg", 8, 2, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[411])},
  {"op", 10, 1, &(msp430_parms::msp430_isa::dec_list[412])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[413])},
  {"sreg", 8, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[415])},
  {"op", 10, 1, &(msp430_parms::msp430_isa::dec_list[416])},
  {"as", 7, 1, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[418])},
  {"op", 10, 3, &(msp430_parms::msp430_isa::dec_list[419])},
