dominiczy/satelliteplatform/processors/msp430sctlm/msp430_isa_init.cpp
  {"as", 7, 1, &(msp430_parms::msp430_isa::dec_list[420])},
  {"sreg", 8, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[422])},
  {"op", 10, 3, &(msp430_parms::msp430_isa::dec_list[423])},
  {"as", 7, 1, &(msp430_parms::msp430_isa::dec_list[424])},
  {"sreg", 8, 2, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[426])},
  {"op", 10, 3, &(msp430_parms::msp430_isa::dec_list[427])},
  {"as", 7, 3, &(msp430_parms::msp430_isa::dec_list[428])},
  {"sreg", 8, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[430])},
  {"op", 10, 3, &(msp430_parms::msp430_isa::dec_list[431])},
  {"as", 7, 1, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[433])},
  {"op", 10, 4, &(msp430_parms::msp430_isa::dec_list[434])},
  {"sreg", 8, 0, &(msp430_parms::msp430_isa::dec_list[435])},
  {"as", 7, 1, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[437])},
  {"op", 10, 4, &(msp430_parms::msp430_isa::dec_list[438])},
  {"sreg", 8, 2, &(msp430_parms::msp430_isa::dec_list[439])},
  {"as", 7, 1, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[441])},
  {"op", 10, 4, &(msp430_parms::msp430_isa::dec_list[442])},
  {"sreg", 8, 0, &(msp430_parms::msp430_isa::dec_list[443])},
  {"as", 7, 3, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[445])},
  {"op", 10, 4, &(msp430_parms::msp430_isa::dec_list[446])},
  {"as", 7, 1, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[448])},
  {"op", 10, 5, &(msp430_parms::msp430_isa::dec_list[449])},
  {"sreg", 8, 0, &(msp430_parms::msp430_isa::dec_list[450])},
  {"as", 7, 1, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[452])},
  {"op", 10, 5, &(msp430_parms::msp430_isa::dec_list[453])},
  {"sreg", 8, 2, &(msp430_parms::msp430_isa::dec_list[454])},
  {"as", 7, 1, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[456])},
  {"op", 10, 5, &(msp430_parms::msp430_isa::dec_list[457])},
  {"sreg", 8, 0, &(msp430_parms::msp430_isa::dec_list[458])},
  {"as", 7, 3, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[460])},
  {"op", 10, 5, &(msp430_parms::msp430_isa::dec_list[461])},
  {"as", 7, 1, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[463])},
  {"op", 10, 0, &(msp430_parms::msp430_isa::dec_list[464])},
  {"as", 7, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[466])},
  {"op", 10, 0, &(msp430_parms::msp430_isa::dec_list[467])},
  {"as", 7, 2, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[469])},
  {"op", 10, 0, &(msp430_parms::msp430_isa::dec_list[470])},
  {"as", 7, 3, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[472])},
  {"op", 10, 2, &(msp430_parms::msp430_isa::dec_list[473])},
  {"as", 7, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[475])},
  {"op", 10, 2, &(msp430_parms::msp430_isa::dec_list[476])},
  {"as", 7, 2, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[478])},
  {"op", 10, 2, &(msp430_parms::msp430_isa::dec_list[479])},
  {"as", 7, 3, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[481])},
  {"op", 10, 1, &(msp430_parms::msp430_isa::dec_list[482])},
  {"as", 7, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[484])},
  {"op", 10, 1, &(msp430_parms::msp430_isa::dec_list[485])},
  {"as", 7, 2, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[487])},
  {"op", 10, 1, &(msp430_parms::msp430_isa::dec_list[488])},
  {"as", 7, 3, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[490])},
  {"op", 10, 3, &(msp430_parms::msp430_isa::dec_list[491])},
  {"as", 7, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[493])},
  {"op", 10, 3, &(msp430_parms::msp430_isa::dec_list[494])},
  {"as", 7, 2, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[496])},
  {"op", 10, 3, &(msp430_parms::msp430_isa::dec_list[497])},
  {"as", 7, 3, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[499])},
  {"op", 10, 4, &(msp430_parms::msp430_isa::dec_list[500])},
  {"as", 7, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[502])},
  {"op", 10, 4, &(msp430_parms::msp430_isa::dec_list[503])},
  {"as", 7, 2, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[505])},
  {"op", 10, 4, &(msp430_parms::msp430_isa::dec_list[506])},
  {"as", 7, 3, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[508])},
  {"op", 10, 5, &(msp430_parms::msp430_isa::dec_list[509])},
  {"as", 7, 0, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[511])},
  {"op", 10, 5, &(msp430_parms::msp430_isa::dec_list[512])},
  {"as", 7, 2, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[514])},
  {"op", 10, 5, &(msp430_parms::msp430_isa::dec_list[515])},
  {"as", 7, 3, NULL},
  {"cnt", 9, 4, &(msp430_parms::msp430_isa::dec_list[517])},
  {"op", 10, 6, NULL},
  {"opc", 11, 1, &(msp430_parms::msp430_isa::dec_list[519])},
  {"c", 12, 0, NULL},
  {"opc", 11, 1, &(msp430_parms::msp430_isa::dec_list[521])},
  {"c", 12, 1, NULL},
  {"opc", 11, 1, &(msp430_parms::msp430_isa::dec_list[523])},
  {"c", 12, 2, NULL},
  {"opc", 11, 1, &(msp430_parms::msp430_isa::dec_list[525])},
  {"c", 12, 3, NULL},
  {"opc", 11, 1, &(msp430_parms::msp430_isa::dec_list[527])},
  {"c", 12, 4, NULL},
  {"opc", 11, 1, &(msp430_parms::msp430_isa::dec_list[529])},
  {"c", 12, 5, NULL},
  {"opc", 11, 1, &(msp430_parms::msp430_isa::dec_list[531])},
  {"c", 12, 6, NULL},
  {"opc", 11, 1, &(msp430_parms::msp430_isa::dec_list[533])},
  {"c", 12, 7, NULL}
};

ac_dec_instr msp430_parms::msp430_isa::instructions[msp430_parms::AC_DEC_INSTR_NUMBER] = {
  {"mov_48imm", 6, "(null)", "(null)", "Double_48", 1, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[0]), 0, &(msp430_parms::msp430_isa::instructions[1])},
  {"mov_48idm", 6, "(null)", "(null)", "Double_48", 2, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[4]), 0, &(msp430_parms::msp430_isa::instructions[2])},
  {"add_48idm", 6, "(null)", "(null)", "Double_48", 3, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[7]), 0, &(msp430_parms::msp430_isa::instructions[3])},
  {"add_48imm", 6, "(null)", "(null)", "Double_48", 4, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[10]), 0, &(msp430_parms::msp430_isa::instructions[4])},
  {"addc_48idm", 6, "(null)", "(null)", "Double_48", 5, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[14]), 0, &(msp430_parms::msp430_isa::instructions[5])},
  {"addc_48imm", 6, "(null)", "(null)", "Double_48", 6, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[17]), 0, &(msp430_parms::msp430_isa::instructions[6])},
  {"and_48idm", 6, "(null)", "(null)", "Double_48", 7, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[21]), 0, &(msp430_parms::msp430_isa::instructions[7])},
  {"and_48imm", 6, "(null)", "(null)", "Double_48", 8, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[24]), 0, &(msp430_parms::msp430_isa::instructions[8])},
  {"bic_48idm", 6, "(null)", "(null)", "Double_48", 9, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[28]), 0, &(msp430_parms::msp430_isa::instructions[9])},
  {"bic_48imm", 6, "(null)", "(null)", "Double_48", 10, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[31]), 0, &(msp430_parms::msp430_isa::instructions[10])},
  {"bis_48idm", 6, "(null)", "(null)", "Double_48", 11, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[35]), 0, &(msp430_parms::msp430_isa::instructions[11])},
  {"bis_48imm", 6, "(null)", "(null)", "Double_48", 12, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[38]), 0, &(msp430_parms::msp430_isa::instructions[12])},
  {"bit_48idm", 6, "(null)", "(null)", "Double_48", 13, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[42]), 0, &(msp430_parms::msp430_isa::instructions[13])},
  {"bit_48imm", 6, "(null)", "(null)", "Double_48", 14, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[45]), 0, &(msp430_parms::msp430_isa::instructions[14])},
  {"cmp_48idm", 6, "(null)", "(null)", "Double_48", 15, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[49]), 0, &(msp430_parms::msp430_isa::instructions[15])},
  {"cmp_48imm", 6, "(null)", "(null)", "Double_48", 16, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[52]), 0, &(msp430_parms::msp430_isa::instructions[16])},
  {"dadd_48idm", 6, "(null)", "(null)", "Double_48", 17, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[56]), 0, &(msp430_parms::msp430_isa::instructions[17])},
  {"dadd_48imm", 6, "(null)", "(null)", "Double_48", 18, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[59]), 0, &(msp430_parms::msp430_isa::instructions[18])},
  {"sub_48idm", 6, "(null)", "(null)", "Double_48", 19, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[63]), 0, &(msp430_parms::msp430_isa::instructions[19])},
  {"sub_48imm", 6, "(null)", "(null)", "Double_48", 20, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[66]), 0, &(msp430_parms::msp430_isa::instructions[20])},
  {"subc_48idm", 6, "(null)", "(null)", "Double_48", 21, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[70]), 0, &(msp430_parms::msp430_isa::instructions[21])},
  {"subc_48imm", 6, "(null)", "(null)", "Double_48", 22, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[73]), 0, &(msp430_parms::msp430_isa::instructions[22])},
  {"xor_48idm", 6, "(null)", "(null)", "Double_48", 23, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[77]), 0, &(msp430_parms::msp430_isa::instructions[23])},
  {"xor_48imm", 6, "(null)", "(null)", "Double_48", 24, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[80]), 0, &(msp430_parms::msp430_isa::instructions[24])},
  {"mov_32idst", 4, "(null)", "(null)", "Double_32", 25, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[84]), 0, &(msp430_parms::msp430_isa::instructions[25])},
  {"mov_32isrc", 4, "(null)", "(null)", "Double_32", 26, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[87]), 0, &(msp430_parms::msp430_isa::instructions[26])},
  {"mov_32imm", 4, "(null)", "(null)", "Double_32", 27, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[90]), 0, &(msp430_parms::msp430_isa::instructions[27])},
  {"mov_32iaim", 4, "(null)", "(null)", "Double_32", 28, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[94]), 0, &(msp430_parms::msp430_isa::instructions[28])},
  {"mov_32irm", 4, "(null)", "(null)", "Double_32", 29, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[97]), 0, &(msp430_parms::msp430_isa::instructions[29])},
  {"add_32idst", 4, "(null)", "(null)", "Double_32", 30, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[99]), 0, &(msp430_parms::msp430_isa::instructions[30])},
  {"add_32isrc", 4, "(null)", "(null)", "Double_32", 31, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[102]), 0, &(msp430_parms::msp430_isa::instructions[31])},
  {"add_32imm", 4, "(null)", "(null)", "Double_32", 32, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[105]), 0, &(msp430_parms::msp430_isa::instructions[32])},
  {"add_32iaim", 4, "(null)", "(null)", "Double_32", 33, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[109]), 0, &(msp430_parms::msp430_isa::instructions[33])},
  {"add_32irm", 4, "(null)", "(null)", "Double_32", 34, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[112]), 0, &(msp430_parms::msp430_isa::instructions[34])},
  {"addc_32idst", 4, "(null)", "(null)", "Double_32", 35, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[114]), 0, &(msp430_parms::msp430_isa::instructions[35])},
  {"addc_32isrc", 4, "(null)", "(null)", "Double_32", 36, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[117]), 0, &(msp430_parms::msp430_isa::instructions[36])},
  {"addc_32imm", 4, "(null)", "(null)", "Double_32", 37, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[120]), 0, &(msp430_parms::msp430_isa::instructions[37])},
  {"addc_32iaim", 4, "(null)", "(null)", "Double_32", 38, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[124]), 0, &(msp430_parms::msp430_isa::instructions[38])},
  {"addc_32irm", 4, "(null)", "(null)", "Double_32", 39, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[127]), 0, &(msp430_parms::msp430_isa::instructions[39])},
  {"and_32idst", 4, "(null)", "(null)", "Double_32", 40, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[129]), 0, &(msp430_parms::msp430_isa::instructions[40])},
  {"and_32isrc", 4, "(null)", "(null)", "Double_32", 41, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[132]), 0, &(msp430_parms::msp430_isa::instructions[41])},
  {"and_32imm", 4, "(null)", "(null)", "Double_32", 42, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[135]), 0, &(msp430_parms::msp430_isa::instructions[42])},
  {"and_32iaim", 4, "(null)", "(null)", "Double_32", 43, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[139]), 0, &(msp430_parms::msp430_isa::instructions[43])},
  {"and_32irm", 4, "(null)", "(null)", "Double_32", 44, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[142]), 0, &(msp430_parms::msp430_isa::instructions[44])},
  {"bic_32idst", 4, "(null)", "(null)", "Double_32", 45, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[144]), 0, &(msp430_parms::msp430_isa::instructions[45])},
  {"bic_32isrc", 4, "(null)", "(null)", "Double_32", 46, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[147]), 0, &(msp430_parms::msp430_isa::instructions[46])},
  {"bic_32imm", 4, "(null)", "(null)", "Double_32", 47, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[150]), 0, &(msp430_parms::msp430_isa::instructions[47])},
  {"bic_32iaim", 4, "(null)", "(null)", "Double_32", 48, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[154]), 0, &(msp430_parms::msp430_isa::instructions[48])},
  {"bic_32irm", 4, "(null)", "(null)", "Double_32", 49, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[157]), 0, &(msp430_parms::msp430_isa::instructions[49])},
  {"bis_32idst", 4, "(null)", "(null)", "Double_32", 50, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[159]), 0, &(msp430_parms::msp430_isa::instructions[50])},
  {"bis_32isrc", 4, "(null)", "(null)", "Double_32", 51, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[162]), 0, &(msp430_parms::msp430_isa::instructions[51])},
  {"bis_32imm", 4, "(null)", "(null)", "Double_32", 52, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[165]), 0, &(msp430_parms::msp430_isa::instructions[52])},
  {"bis_32iaim", 4, "(null)", "(null)", "Double_32", 53, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[169]), 0, &(msp430_parms::msp430_isa::instructions[53])},
  {"bis_32irm", 4, "(null)", "(null)", "Double_32", 54, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[172]), 0, &(msp430_parms::msp430_isa::instructions[54])},
  {"bit_32idst", 4, "(null)", "(null)", "Double_32", 55, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[174]), 0, &(msp430_parms::msp430_isa::instructions[55])},
  {"bit_32isrc", 4, "(null)", "(null)", "Double_32", 56, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[177]), 0, &(msp430_parms::msp430_isa::instructions[56])},
  {"bit_32imm", 4, "(null)", "(null)", "Double_32", 57, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[180]), 0, &(msp430_parms::msp430_isa::instructions[57])},
  {"bit_32iaim", 4, "(null)", "(null)", "Double_32", 58, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[184]), 0, &(msp430_parms::msp430_isa::instructions[58])},
  {"bit_32irm", 4, "(null)", "(null)", "Double_32", 59, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[187]), 0, &(msp430_parms::msp430_isa::instructions[59])},
  {"cmp_32idst", 4, "(null)", "(null)", "Double_32", 60, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[189]), 0, &(msp430_parms::msp430_isa::instructions[60])},
  {"cmp_32isrc", 4, "(null)", "(null)", "Double_32", 61, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[192]), 0, &(msp430_parms::msp430_isa::instructions[61])},
  {"cmp_32imm", 4, "(null)", "(null)", "Double_32", 62, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[195]), 0, &(msp430_parms::msp430_isa::instructions[62])},
  {"cmp_32iaim", 4, "(null)", "(null)", "Double_32", 63, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[199]), 0, &(msp430_parms::msp430_isa::instructions[63])},
  {"cmp_32irm", 4, "(null)", "(null)", "Double_32", 64, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[202]), 0, &(msp430_parms::msp430_isa::instructions[64])},
  {"dadd_32idst", 4, "(null)", "(null)", "Double_32", 65, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[204]), 0, &(msp430_parms::msp430_isa::instructions[65])},
  {"dadd_32isrc", 4, "(null)", "(null)", "Double_32", 66, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[207]), 0, &(msp430_parms::msp430_isa::instructions[66])},
  {"dadd_32imm", 4, "(null)", "(null)", "Double_32", 67, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[210]), 0, &(msp430_parms::msp430_isa::instructions[67])},
  {"dadd_32iaim", 4, "(null)", "(null)", "Double_32", 68, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[214]), 0, &(msp430_parms::msp430_isa::instructions[68])},
  {"dadd_32irm", 4, "(null)", "(null)", "Double_32", 69, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[217]), 0, &(msp430_parms::msp430_isa::instructions[69])},
  {"sub_32idst", 4, "(null)", "(null)", "Double_32", 70, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[219]), 0, &(msp430_parms::msp430_isa::instructions[70])},
  {"sub_32isrc", 4, "(null)", "(null)", "Double_32", 71, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[222]), 0, &(msp430_parms::msp430_isa::instructions[71])},
  {"sub_32imm", 4, "(null)", "(null)", "Double_32", 72, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[225]), 0, &(msp430_parms::msp430_isa::instructions[72])},
  {"sub_32iaim", 4, "(null)", "(null)", "Double_32", 73, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[229]), 0, &(msp430_parms::msp430_isa::instructions[73])},
  {"sub_32irm", 4, "(null)", "(null)", "Double_32", 74, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[232]), 0, &(msp430_parms::msp430_isa::instructions[74])},
  {"subc_32idst", 4, "(null)", "(null)", "Double_32", 75, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[234]), 0, &(msp430_parms::msp430_isa::instructions[75])},
  {"subc_32isrc", 4, "(null)", "(null)", "Double_32", 76, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[237]), 0, &(msp430_parms::msp430_isa::instructions[76])},
  {"subc_32imm", 4, "(null)", "(null)", "Double_32", 77, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[240]), 0, &(msp430_parms::msp430_isa::instructions[77])},
  {"subc_32iaim", 4, "(null)", "(null)", "Double_32", 78, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[244]), 0, &(msp430_parms::msp430_isa::instructions[78])},
  {"subc_32irm", 4, "(null)", "(null)", "Double_32", 79, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[247]), 0, &(msp430_parms::msp430_isa::instructions[79])},
  {"xor_32idst", 4, "(null)", "(null)", "Double_32", 80, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[249]), 0, &(msp430_parms::msp430_isa::instructions[80])},
  {"xor_32isrc", 4, "(null)", "(null)", "Double_32", 81, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[252]), 0, &(msp430_parms::msp430_isa::instructions[81])},
  {"xor_32imm", 4, "(null)", "(null)", "Double_32", 82, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[255]), 0, &(msp430_parms::msp430_isa::instructions[82])},
  {"xor_32iaim", 4, "(null)", "(null)", "Double_32", 83, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[259]), 0, &(msp430_parms::msp430_isa::instructions[83])},
  {"xor_32irm", 4, "(null)", "(null)", "Double_32", 84, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[262]), 0, &(msp430_parms::msp430_isa::instructions[84])},
  {"mov_16rm", 2, "(null)", "(null)", "Double", 85, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[264]), 0, &(msp430_parms::msp430_isa::instructions[85])},
  {"mov_16irm", 2, "(null)", "(null)", "Double", 86, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[267]), 0, &(msp430_parms::msp430_isa::instructions[86])},
  {"mov_16iaim", 2, "(null)", "(null)", "Double", 87, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[270]), 0, &(msp430_parms::msp430_isa::instructions[87])},
  {"add_16rm", 2, "(null)", "(null)", "Double", 88, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[273]), 0, &(msp430_parms::msp430_isa::instructions[88])},
  {"add_16irm", 2, "(null)", "(null)", "Double", 89, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[276]), 0, &(msp430_parms::msp430_isa::instructions[89])},
  {"add_16iaim", 2, "(null)", "(null)", "Double", 90, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[279]), 0, &(msp430_parms::msp430_isa::instructions[90])},
  {"addc_16rm", 2, "(null)", "(null)", "Double", 91, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[282]), 0, &(msp430_parms::msp430_isa::instructions[91])},
  {"addc_16irm", 2, "(null)", "(null)", "Double", 92, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[285]), 0, &(msp430_parms::msp430_isa::instructions[92])},
  {"addc_16iaim", 2, "(null)", "(null)", "Double", 93, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[288]), 0, &(msp430_parms::msp430_isa::instructions[93])},
  {"and_16rm", 2, "(null)", "(null)", "Double", 94, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[291]), 0, &(msp430_parms::msp430_isa::instructions[94])},
  {"and_16irm", 2, "(null)", "(null)", "Double", 95, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[294]), 0, &(msp430_parms::msp430_isa::instructions[95])},
  {"and_16iaim", 2, "(null)", "(null)", "Double", 96, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[297]), 0, &(msp430_parms::msp430_isa::instructions[96])},
  {"bic_16rm", 2, "(null)", "(null)", "Double", 97, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[300]), 0, &(msp430_parms::msp430_isa::instructions[97])},
  {"bic_16irm", 2, "(null)", "(null)", "Double", 98, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[303]), 0, &(msp430_parms::msp430_isa::instructions[98])},
  {"bic_16iaim", 2, "(null)", "(null)", "Double", 99, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[306]), 0, &(msp430_parms::msp430_isa::instructions[99])},
  {"bis_16rm", 2, "(null)", "(null)", "Double", 100, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[309]), 0, &(msp430_parms::msp430_isa::instructions[100])},
  {"bis_16irm", 2, "(null)", "(null)", "Double", 101, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[312]), 0, &(msp430_parms::msp430_isa::instructions[101])},
  {"bis_16iaim", 2, "(null)", "(null)", "Double", 102, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[315]), 0, &(msp430_parms::msp430_isa::instructions[102])},
  {"bit_16rm", 2, "(null)", "(null)", "Double", 103, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[318]), 0, &(msp430_parms::msp430_isa::instructions[103])},
  {"bit_16irm", 2, "(null)", "(null)", "Double", 104, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[321]), 0, &(msp430_parms::msp430_isa::instructions[104])},
  {"bit_16iaim", 2, "(null)", "(null)", "Double", 105, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[324]), 0, &(msp430_parms::msp430_isa::instructions[105])},
  {"cmp_16rm", 2, "(null)", "(null)", "Double", 106, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[327]), 0, &(msp430_parms::msp430_isa::instructions[106])},
  {"cmp_16irm", 2, "(null)", "(null)", "Double", 107, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[330]), 0, &(msp430_parms::msp430_isa::instructions[107])},
  {"cmp_16iaim", 2, "(null)", "(null)", "Double", 108, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[333]), 0, &(msp430_parms::msp430_isa::instructions[108])},
  {"dadd_16rm", 2, "(null)", "(null)", "Double", 109, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[336]), 0, &(msp430_parms::msp430_isa::instructions[109])},
  {"dadd_16irm", 2, "(null)", "(null)", "Double", 110, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[339]), 0, &(msp430_parms::msp430_isa::instructions[110])},
  {"dadd_16iaim", 2, "(null)", "(null)", "Double", 111, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[342]), 0, &(msp430_parms::msp430_isa::instructions[111])},
  {"sub_16rm", 2, "(null)", "(null)", "Double", 112, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[345]), 0, &(msp430_parms::msp430_isa::instructions[112])},
  {"sub_16irm", 2, "(null)", "(null)", "Double", 113, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[348]), 0, &(msp430_parms::msp430_isa::instructions[113])},
  {"sub_16iaim", 2, "(null)", "(null)", "Double", 114, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[351]), 0, &(msp430_parms::msp430_isa::instructions[114])},
  {"subc_16rm", 2, "(null)", "(null)", "Double", 115, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[354]), 0, &(msp430_parms::msp430_isa::instructions[115])},
