dominiczy/satelliteplatform/processors/msp430sctlm/msp430_isa_init.cpp
  {"subc_16irm", 2, "(null)", "(null)", "Double", 116, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[357]), 0, &(msp430_parms::msp430_isa::instructions[116])},
  {"subc_16iaim", 2, "(null)", "(null)", "Double", 117, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[360]), 0, &(msp430_parms::msp430_isa::instructions[117])},
  {"xor_16rm", 2, "(null)", "(null)", "Double", 118, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[363]), 0, &(msp430_parms::msp430_isa::instructions[118])},
  {"xor_16irm", 2, "(null)", "(null)", "Double", 119, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[366]), 0, &(msp430_parms::msp430_isa::instructions[119])},
  {"xor_16iaim", 2, "(null)", "(null)", "Double", 120, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[369]), 0, &(msp430_parms::msp430_isa::instructions[120])},
  {"rrc_32sm", 4, "(null)", "(null)", "Single_32", 121, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[372]), 0, &(msp430_parms::msp430_isa::instructions[121])},
  {"rrc_32am", 4, "(null)", "(null)", "Single_32", 122, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[376]), 0, &(msp430_parms::msp430_isa::instructions[122])},
  {"rrc_32imm", 4, "(null)", "(null)", "Single_32", 123, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[380]), 0, &(msp430_parms::msp430_isa::instructions[123])},
  {"rrc_32im", 4, "(null)", "(null)", "Single_32", 124, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[384]), 0, &(msp430_parms::msp430_isa::instructions[124])},
  {"rra_32sm", 4, "(null)", "(null)", "Single_32", 125, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[387]), 0, &(msp430_parms::msp430_isa::instructions[125])},
  {"rra_32am", 4, "(null)", "(null)", "Single_32", 126, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[391]), 0, &(msp430_parms::msp430_isa::instructions[126])},
  {"rra_32imm", 4, "(null)", "(null)", "Single_32", 127, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[395]), 0, &(msp430_parms::msp430_isa::instructions[127])},
  {"rra_32im", 4, "(null)", "(null)", "Single_32", 128, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[399]), 0, &(msp430_parms::msp430_isa::instructions[128])},
  {"swpb_32sm", 4, "(null)", "(null)", "Single_32", 129, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[402]), 0, &(msp430_parms::msp430_isa::instructions[129])},
  {"swpb_32am", 4, "(null)", "(null)", "Single_32", 130, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[406]), 0, &(msp430_parms::msp430_isa::instructions[130])},
  {"swpb_32imm", 4, "(null)", "(null)", "Single_32", 131, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[410]), 0, &(msp430_parms::msp430_isa::instructions[131])},
  {"swpb_32im", 4, "(null)", "(null)", "Single_32", 132, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[414]), 0, &(msp430_parms::msp430_isa::instructions[132])},
  {"sxt_32sm", 4, "(null)", "(null)", "Single_32", 133, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[417]), 0, &(msp430_parms::msp430_isa::instructions[133])},
  {"sxt_32am", 4, "(null)", "(null)", "Single_32", 134, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[421]), 0, &(msp430_parms::msp430_isa::instructions[134])},
  {"sxt_32imm", 4, "(null)", "(null)", "Single_32", 135, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[425]), 0, &(msp430_parms::msp430_isa::instructions[135])},
  {"sxt_32im", 4, "(null)", "(null)", "Single_32", 136, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[429]), 0, &(msp430_parms::msp430_isa::instructions[136])},
  {"push_32sm", 4, "(null)", "(null)", "Single_32", 137, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[432]), 0, &(msp430_parms::msp430_isa::instructions[137])},
  {"push_32am", 4, "(null)", "(null)", "Single_32", 138, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[436]), 0, &(msp430_parms::msp430_isa::instructions[138])},
  {"push_32imm", 4, "(null)", "(null)", "Single_32", 139, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[440]), 0, &(msp430_parms::msp430_isa::instructions[139])},
  {"push_32im", 4, "(null)", "(null)", "Single_32", 140, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[444]), 0, &(msp430_parms::msp430_isa::instructions[140])},
  {"call_32sm", 4, "(null)", "(null)", "Single_32", 141, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[447]), 0, &(msp430_parms::msp430_isa::instructions[141])},
  {"call_32am", 4, "(null)", "(null)", "Single_32", 142, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[451]), 0, &(msp430_parms::msp430_isa::instructions[142])},
  {"call_32imm", 4, "(null)", "(null)", "Single_32", 143, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[455]), 0, &(msp430_parms::msp430_isa::instructions[143])},
  {"call_32im", 4, "(null)", "(null)", "Single_32", 144, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[459]), 0, &(msp430_parms::msp430_isa::instructions[144])},
  {"rrc_16rm", 2, "(null)", "(null)", "Single", 145, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[462]), 0, &(msp430_parms::msp430_isa::instructions[145])},
  {"rrc_16irm", 2, "(null)", "(null)", "Single", 146, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[465]), 0, &(msp430_parms::msp430_isa::instructions[146])},
  {"rrc_16iaim", 2, "(null)", "(null)", "Single", 147, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[468]), 0, &(msp430_parms::msp430_isa::instructions[147])},
  {"rra_16rm", 2, "(null)", "(null)", "Single", 148, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[471]), 0, &(msp430_parms::msp430_isa::instructions[148])},
  {"rra_16irm", 2, "(null)", "(null)", "Single", 149, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[474]), 0, &(msp430_parms::msp430_isa::instructions[149])},
  {"rra_16iaim", 2, "(null)", "(null)", "Single", 150, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[477]), 0, &(msp430_parms::msp430_isa::instructions[150])},
  {"swpb_16rm", 2, "(null)", "(null)", "Single", 151, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[480]), 0, &(msp430_parms::msp430_isa::instructions[151])},
  {"swpb_16irm", 2, "(null)", "(null)", "Single", 152, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[483]), 0, &(msp430_parms::msp430_isa::instructions[152])},
  {"swpb_16iaim", 2, "(null)", "(null)", "Single", 153, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[486]), 0, &(msp430_parms::msp430_isa::instructions[153])},
  {"sxt_16rm", 2, "(null)", "(null)", "Single", 154, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[489]), 0, &(msp430_parms::msp430_isa::instructions[154])},
  {"sxt_16irm", 2, "(null)", "(null)", "Single", 155, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[492]), 0, &(msp430_parms::msp430_isa::instructions[155])},
  {"sxt_16iaim", 2, "(null)", "(null)", "Single", 156, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[495]), 0, &(msp430_parms::msp430_isa::instructions[156])},
  {"push_16rm", 2, "(null)", "(null)", "Single", 157, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[498]), 0, &(msp430_parms::msp430_isa::instructions[157])},
  {"push_16irm", 2, "(null)", "(null)", "Single", 158, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[501]), 0, &(msp430_parms::msp430_isa::instructions[158])},
  {"push_16iaim", 2, "(null)", "(null)", "Single", 159, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[504]), 0, &(msp430_parms::msp430_isa::instructions[159])},
  {"call_16rm", 2, "(null)", "(null)", "Single", 160, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[507]), 0, &(msp430_parms::msp430_isa::instructions[160])},
  {"call_16irm", 2, "(null)", "(null)", "Single", 161, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[510]), 0, &(msp430_parms::msp430_isa::instructions[161])},
  {"call_16iaim", 2, "(null)", "(null)", "Single", 162, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[513]), 0, &(msp430_parms::msp430_isa::instructions[162])},
  {"reti", 2, "(null)", "(null)", "Single", 163, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[516]), 0, &(msp430_parms::msp430_isa::instructions[163])},
  {"jne", 2, "(null)", "(null)", "Jump", 164, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[518]), 0, &(msp430_parms::msp430_isa::instructions[164])},
  {"jeq", 2, "(null)", "(null)", "Jump", 165, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[520]), 0, &(msp430_parms::msp430_isa::instructions[165])},
  {"jnc", 2, "(null)", "(null)", "Jump", 166, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[522]), 0, &(msp430_parms::msp430_isa::instructions[166])},
  {"jc", 2, "(null)", "(null)", "Jump", 167, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[524]), 0, &(msp430_parms::msp430_isa::instructions[167])},
  {"jn", 2, "(null)", "(null)", "Jump", 168, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[526]), 0, &(msp430_parms::msp430_isa::instructions[168])},
  {"jge", 2, "(null)", "(null)", "Jump", 169, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[528]), 0, &(msp430_parms::msp430_isa::instructions[169])},
  {"jl", 2, "(null)", "(null)", "Jump", 170, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[530]), 0, &(msp430_parms::msp430_isa::instructions[170])},
  {"jmp", 2, "(null)", "(null)", "Jump", 171, 1, 1, 1, &(msp430_parms::msp430_isa::dec_list[532]), 0, NULL}
};

const ac_instr_info
msp430_parms::msp430_isa::instr_table[msp430_parms::AC_DEC_INSTR_NUMBER + 1] = {
  ac_instr_info(0, "_ac_invalid_", "_ac_invalid_", 2),
  ac_instr_info(1, "mov_48imm", "(null)", 6),
  ac_instr_info(2, "mov_48idm", "(null)", 6),
  ac_instr_info(3, "add_48idm", "(null)", 6),
  ac_instr_info(4, "add_48imm", "(null)", 6),
  ac_instr_info(5, "addc_48idm", "(null)", 6),
  ac_instr_info(6, "addc_48imm", "(null)", 6),
  ac_instr_info(7, "and_48idm", "(null)", 6),
  ac_instr_info(8, "and_48imm", "(null)", 6),
  ac_instr_info(9, "bic_48idm", "(null)", 6),
  ac_instr_info(10, "bic_48imm", "(null)", 6),
  ac_instr_info(11, "bis_48idm", "(null)", 6),
  ac_instr_info(12, "bis_48imm", "(null)", 6),
  ac_instr_info(13, "bit_48idm", "(null)", 6),
  ac_instr_info(14, "bit_48imm", "(null)", 6),
  ac_instr_info(15, "cmp_48idm", "(null)", 6),
  ac_instr_info(16, "cmp_48imm", "(null)", 6),
  ac_instr_info(17, "dadd_48idm", "(null)", 6),
  ac_instr_info(18, "dadd_48imm", "(null)", 6),
  ac_instr_info(19, "sub_48idm", "(null)", 6),
  ac_instr_info(20, "sub_48imm", "(null)", 6),
  ac_instr_info(21, "subc_48idm", "(null)", 6),
  ac_instr_info(22, "subc_48imm", "(null)", 6),
  ac_instr_info(23, "xor_48idm", "(null)", 6),
  ac_instr_info(24, "xor_48imm", "(null)", 6),
  ac_instr_info(25, "mov_32idst", "(null)", 4),
  ac_instr_info(26, "mov_32isrc", "(null)", 4),
  ac_instr_info(27, "mov_32imm", "(null)", 4),
  ac_instr_info(28, "mov_32iaim", "(null)", 4),
  ac_instr_info(29, "mov_32irm", "(null)", 4),
  ac_instr_info(30, "add_32idst", "(null)", 4),
  ac_instr_info(31, "add_32isrc", "(null)", 4),
  ac_instr_info(32, "add_32imm", "(null)", 4),
  ac_instr_info(33, "add_32iaim", "(null)", 4),
  ac_instr_info(34, "add_32irm", "(null)", 4),
  ac_instr_info(35, "addc_32idst", "(null)", 4),
  ac_instr_info(36, "addc_32isrc", "(null)", 4),
  ac_instr_info(37, "addc_32imm", "(null)", 4),
  ac_instr_info(38, "addc_32iaim", "(null)", 4),
  ac_instr_info(39, "addc_32irm", "(null)", 4),
  ac_instr_info(40, "and_32idst", "(null)", 4),
  ac_instr_info(41, "and_32isrc", "(null)", 4),
  ac_instr_info(42, "and_32imm", "(null)", 4),
  ac_instr_info(43, "and_32iaim", "(null)", 4),
  ac_instr_info(44, "and_32irm", "(null)", 4),
  ac_instr_info(45, "bic_32idst", "(null)", 4),
  ac_instr_info(46, "bic_32isrc", "(null)", 4),
  ac_instr_info(47, "bic_32imm", "(null)", 4),
  ac_instr_info(48, "bic_32iaim", "(null)", 4),
  ac_instr_info(49, "bic_32irm", "(null)", 4),
  ac_instr_info(50, "bis_32idst", "(null)", 4),
  ac_instr_info(51, "bis_32isrc", "(null)", 4),
  ac_instr_info(52, "bis_32imm", "(null)", 4),
  ac_instr_info(53, "bis_32iaim", "(null)", 4),
  ac_instr_info(54, "bis_32irm", "(null)", 4),
  ac_instr_info(55, "bit_32idst", "(null)", 4),
  ac_instr_info(56, "bit_32isrc", "(null)", 4),
  ac_instr_info(57, "bit_32imm", "(null)", 4),
  ac_instr_info(58, "bit_32iaim", "(null)", 4),
  ac_instr_info(59, "bit_32irm", "(null)", 4),
  ac_instr_info(60, "cmp_32idst", "(null)", 4),
  ac_instr_info(61, "cmp_32isrc", "(null)", 4),
  ac_instr_info(62, "cmp_32imm", "(null)", 4),
  ac_instr_info(63, "cmp_32iaim", "(null)", 4),
  ac_instr_info(64, "cmp_32irm", "(null)", 4),
  ac_instr_info(65, "dadd_32idst", "(null)", 4),
  ac_instr_info(66, "dadd_32isrc", "(null)", 4),
  ac_instr_info(67, "dadd_32imm", "(null)", 4),
  ac_instr_info(68, "dadd_32iaim", "(null)", 4),
  ac_instr_info(69, "dadd_32irm", "(null)", 4),
  ac_instr_info(70, "sub_32idst", "(null)", 4),
  ac_instr_info(71, "sub_32isrc", "(null)", 4),
  ac_instr_info(72, "sub_32imm", "(null)", 4),
  ac_instr_info(73, "sub_32iaim", "(null)", 4),
  ac_instr_info(74, "sub_32irm", "(null)", 4),
  ac_instr_info(75, "subc_32idst", "(null)", 4),
  ac_instr_info(76, "subc_32isrc", "(null)", 4),
  ac_instr_info(77, "subc_32imm", "(null)", 4),
  ac_instr_info(78, "subc_32iaim", "(null)", 4),
  ac_instr_info(79, "subc_32irm", "(null)", 4),
  ac_instr_info(80, "xor_32idst", "(null)", 4),
  ac_instr_info(81, "xor_32isrc", "(null)", 4),
  ac_instr_info(82, "xor_32imm", "(null)", 4),
  ac_instr_info(83, "xor_32iaim", "(null)", 4),
  ac_instr_info(84, "xor_32irm", "(null)", 4),
  ac_instr_info(85, "mov_16rm", "(null)", 2),
  ac_instr_info(86, "mov_16irm", "(null)", 2),
  ac_instr_info(87, "mov_16iaim", "(null)", 2),
  ac_instr_info(88, "add_16rm", "(null)", 2),
  ac_instr_info(89, "add_16irm", "(null)", 2),
  ac_instr_info(90, "add_16iaim", "(null)", 2),
  ac_instr_info(91, "addc_16rm", "(null)", 2),
  ac_instr_info(92, "addc_16irm", "(null)", 2),
  ac_instr_info(93, "addc_16iaim", "(null)", 2),
  ac_instr_info(94, "and_16rm", "(null)", 2),
  ac_instr_info(95, "and_16irm", "(null)", 2),
  ac_instr_info(96, "and_16iaim", "(null)", 2),
  ac_instr_info(97, "bic_16rm", "(null)", 2),
  ac_instr_info(98, "bic_16irm", "(null)", 2),
  ac_instr_info(99, "bic_16iaim", "(null)", 2),
  ac_instr_info(100, "bis_16rm", "(null)", 2),
  ac_instr_info(101, "bis_16irm", "(null)", 2),
  ac_instr_info(102, "bis_16iaim", "(null)", 2),
  ac_instr_info(103, "bit_16rm", "(null)", 2),
  ac_instr_info(104, "bit_16irm", "(null)", 2),
  ac_instr_info(105, "bit_16iaim", "(null)", 2),
  ac_instr_info(106, "cmp_16rm", "(null)", 2),
  ac_instr_info(107, "cmp_16irm", "(null)", 2),
  ac_instr_info(108, "cmp_16iaim", "(null)", 2),
  ac_instr_info(109, "dadd_16rm", "(null)", 2),
  ac_instr_info(110, "dadd_16irm", "(null)", 2),
  ac_instr_info(111, "dadd_16iaim", "(null)", 2),
  ac_instr_info(112, "sub_16rm", "(null)", 2),
  ac_instr_info(113, "sub_16irm", "(null)", 2),
  ac_instr_info(114, "sub_16iaim", "(null)", 2),
  ac_instr_info(115, "subc_16rm", "(null)", 2),
  ac_instr_info(116, "subc_16irm", "(null)", 2),
  ac_instr_info(117, "subc_16iaim", "(null)", 2),
  ac_instr_info(118, "xor_16rm", "(null)", 2),
  ac_instr_info(119, "xor_16irm", "(null)", 2),
  ac_instr_info(120, "xor_16iaim", "(null)", 2),
  ac_instr_info(121, "rrc_32sm", "(null)", 4),
  ac_instr_info(122, "rrc_32am", "(null)", 4),
  ac_instr_info(123, "rrc_32imm", "(null)", 4),
  ac_instr_info(124, "rrc_32im", "(null)", 4),
  ac_instr_info(125, "rra_32sm", "(null)", 4),
  ac_instr_info(126, "rra_32am", "(null)", 4),
  ac_instr_info(127, "rra_32imm", "(null)", 4),
  ac_instr_info(128, "rra_32im", "(null)", 4),
  ac_instr_info(129, "swpb_32sm", "(null)", 4),
  ac_instr_info(130, "swpb_32am", "(null)", 4),
  ac_instr_info(131, "swpb_32imm", "(null)", 4),
  ac_instr_info(132, "swpb_32im", "(null)", 4),
  ac_instr_info(133, "sxt_32sm", "(null)", 4),
  ac_instr_info(134, "sxt_32am", "(null)", 4),
  ac_instr_info(135, "sxt_32imm", "(null)", 4),
  ac_instr_info(136, "sxt_32im", "(null)", 4),
  ac_instr_info(137, "push_32sm", "(null)", 4),
  ac_instr_info(138, "push_32am", "(null)", 4),
  ac_instr_info(139, "push_32imm", "(null)", 4),
  ac_instr_info(140, "push_32im", "(null)", 4),
  ac_instr_info(141, "call_32sm", "(null)", 4),
  ac_instr_info(142, "call_32am", "(null)", 4),
  ac_instr_info(143, "call_32imm", "(null)", 4),
  ac_instr_info(144, "call_32im", "(null)", 4),
  ac_instr_info(145, "rrc_16rm", "(null)", 2),
  ac_instr_info(146, "rrc_16irm", "(null)", 2),
  ac_instr_info(147, "rrc_16iaim", "(null)", 2),
  ac_instr_info(148, "rra_16rm", "(null)", 2),
  ac_instr_info(149, "rra_16irm", "(null)", 2),
  ac_instr_info(150, "rra_16iaim", "(null)", 2),
  ac_instr_info(151, "swpb_16rm", "(null)", 2),
  ac_instr_info(152, "swpb_16irm", "(null)", 2),
  ac_instr_info(153, "swpb_16iaim", "(null)", 2),
  ac_instr_info(154, "sxt_16rm", "(null)", 2),
  ac_instr_info(155, "sxt_16irm", "(null)", 2),
  ac_instr_info(156, "sxt_16iaim", "(null)", 2),
  ac_instr_info(157, "push_16rm", "(null)", 2),
  ac_instr_info(158, "push_16irm", "(null)", 2),
  ac_instr_info(159, "push_16iaim", "(null)", 2),
  ac_instr_info(160, "call_16rm", "(null)", 2),
  ac_instr_info(161, "call_16irm", "(null)", 2),
  ac_instr_info(162, "call_16iaim", "(null)", 2),
  ac_instr_info(163, "reti", "(null)", 2),
  ac_instr_info(164, "jne", "(null)", 2),
  ac_instr_info(165, "jeq", "(null)", 2),
  ac_instr_info(166, "jnc", "(null)", 2),
  ac_instr_info(167, "jc", "(null)", 2),
  ac_instr_info(168, "jn", "(null)", 2),
  ac_instr_info(169, "jge", "(null)", 2),
  ac_instr_info(170, "jl", "(null)", 2),
  ac_instr_info(171, "jmp", "(null)", 2)
};
